Revit 2026 API

# VertexStreamPositionColored Class

---

A stream that can be used to write vertices of type VertexPositionColored into a buffer (see VertexBuffer).

SystemObject Autodesk.Revit.DB.DirectContext3DVertexStream Autodesk.Revit.DB.DirectContext3DVertexStreamPositionColored

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexStreamPositionColored : VertexStream
```
```vb
Public Class VertexStreamPositionColored
	Inherits VertexStream
```
```cpp
public ref class VertexStreamPositionColored : public VertexStream
```
```fsharp
type VertexStreamPositionColored =
    class
        inherit VertexStream
    end
```

The VertexStreamPositionColored type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from VertexStream) |

|  | Name | Description |
| --- | --- | --- |
|  | AddVertex | Inserts a VertexStreamPositionColored into the stream and associated buffer. |
|  | AddVertices |  |
|  | Dispose | (Inherited from VertexStream) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace